[
  {
    "id": "1",
    "name": "High-Speed Power Chucks",
    "price": "Varies by model",
    "titleImage": "https://yashukaushik01.github.io/ck-enterprise-web/1_power_chuck.jpg",
    "heading1": "High-Speed Power Chucks by C.K ENTERPRISES – Precision for Modern Turning Centers",
    "text1": "C.K ENTERPRISES offers a range of high-speed power chucks designed for optimal performance in modern turning centers. With various jaw configurations and diameters, these chucks are built to deliver exceptional gripping power, precision, and durability for any machining application.",
    "heading2": "Why Choose C.K ENTERPRISES High-Speed Power Chucks?",
    "text2": "Our power chucks are equipped with an advanced wedge hook gripping system, ensuring secure and stable clamping even at high speeds. The case-hardened bodies guarantee longevity, while their compact and lightweight design enhances the overall efficiency of your machines.",
    "heading3": "Available Models and Specifications:",
    "text3": "- **2 Jaw Power Chuck**: \n  Available in diameters from 100 mm to 315 mm, this variant is ideal for handling a variety of workpiece sizes in bar work applications. \n  Price: $1000 \n\n- **3 Jaw Power Chuck**: \n  Available in all diameters, the 3 Jaw Power Chuck provides versatile clamping for diverse turning needs. \n  Price: $1200 \n\n- **4 Jaw Power Chuck**: \n  Starting from 165 mm, the 4 Jaw Power Chuck is designed for specialized high-precision tasks. \n  Price: $1400",
    "heading4": "Included Accessories:",
    "text4": "- One set of soft jaws for each power chuck configuration. \n- A complete set of T-nuts and bolts for secure mounting. \n- Mounting bolts to ensure proper attachment. \n- Chucknut handle with dowel and grease gun for maintenance and smooth operation.",
    "heading5": "Built for Performance and Durability",
    "text5": "C.K ENTERPRISES High-Speed Power Chucks are engineered to maximize productivity and precision in your machining operations, delivering a balance of strength, efficiency, and versatility. Whether you're handling bar work, high-precision tasks, or specialized clamping needs, our power chucks offer the reliability and performance you need."
  },
  {
    "id": "2",
    "name": "Power Chuck Lockter",
    "price": "$1500",
    "titleImage": "https://yashukaushik01.github.io/ck-enterprise-web/2_lockter.jpg",
    "heading1": "Power Chuck Lockter – High-Precision Locking Chuck by C.K ENTERPRISES",
    "text1": "The Power Chuck Lockter by C.K ENTERPRISES is a high-precision locking chuck, specially designed for applications requiring secure and stable clamping. It is ideal for high-speed machining tasks and provides exceptional performance even under heavy workloads.",
    "heading2": "Why Choose the Power Chuck Lockter from C.K ENTERPRISES?",
    "text2": "This chuck features an advanced locking mechanism that ensures maximum grip stability, reducing slippage during operations. Its rugged construction and case-hardened body guarantee long-term durability and exceptional performance, even in the most demanding environments.",
    "heading3": "Available Models and Specifications:",
    "text3": "The Power Chuck Lockter is available in various sizes, starting from a diameter of 200 mm. This flexibility allows it to accommodate a wide range of workpiece dimensions, making it perfect for precision applications.",
    "heading4": "Included Accessories:",
    "text4": "Each Power Chuck Lockter comes with a set of soft jaws, T-nuts and bolts for secure mounting, mounting bolts, and a chucknut handle with a grease gun for easy maintenance and operation.",
    "heading5": "Enhanced Performance and Durability",
    "text5": "The Power Chuck Lockter is engineered to provide superior gripping strength, precision, and longevity. Its locking mechanism ensures stability, allowing for high-precision machining without compromising on performance. Choose C.K ENTERPRISES for reliable and efficient chuck solutions."
  },
  {
    "id": "3",
    "name": "C.K ENTERPRISES Chuck Spare Parts",
    "titleImage": "https://yashukaushik01.github.io/ck-enterprise-web/3_ck_enterprises_chuck_spare_parts.jpg",
    "heading": "Explore Our Range of Chuck Spare Parts",
    "description": "C.K ENTERPRISES offers a comprehensive selection of high-quality chuck spare parts designed for precision and reliability. Each component is engineered to enhance the performance and longevity of your machining operations.",
    "images": [
      {
        "image": "https://unsplash.com/photos/soft-jaws-image"
      },
      {
        "image": "https://unsplash.com/photos/t-nuts-bolts-image"
      },
      {
        "image": "https://unsplash.com/photos/chucknut-handle-image"
      },
      {
        "image": "https://unsplash.com/photos/grease-gun-image"
      },
      {
        "image": "https://unsplash.com/photos/mounting-bolts-image"
      }
    ],
    "overall_detail": "Our spare parts include soft jaws for delicate clamping, T-nuts and bolts for secure mounting, chucknut handles for easy adjustments, grease guns for maintenance, and high-strength mounting bolts, ensuring optimal performance in your CNC machining operations."
  },
  {
    "id": "4",
    "name": "Close Center Chuck",
    "price": "$1200",
    "titleImage": "https://yashukaushik01.github.io/ck-enterprise-web/4_close_center_chuck.jpg",
    "heading1": "Close Center Chuck – Precision Clamping Solution by C.K ENTERPRISES",
    "text1": "The Close Center Chuck from C.K ENTERPRISES is expertly designed for precision clamping, offering enhanced stability and accuracy in CNC machining operations. This chuck is ideal for applications requiring tight tolerances and consistent performance.",
    "heading2": "Why Choose the Close Center Chuck from C.K ENTERPRISES?",
    "text2": "Featuring a unique close center design, this chuck provides superior gripping force, minimizing vibrations and ensuring precise machining. Its robust construction guarantees durability and longevity, making it a reliable choice for demanding machining tasks.",
    "heading3": "Available Sizes and Specifications:",
    "text3": "The Close Center Chuck is available in various sizes, catering to different workpiece dimensions, making it suitable for both small and large components.",
    "heading4": "Included Accessories:",
    "text4": "Each Close Center Chuck comes with essential accessories, including a set of soft jaws and mounting hardware, ensuring quick setup and reliable operation.",
    "heading5": "Enhanced Performance and Versatility",
    "text5": "With its innovative design and high-quality materials, the Close Center Chuck by C.K ENTERPRISES is engineered to provide maximum performance in your CNC operations, enhancing productivity and precision."
  },
  {
    "id": "5",
    "name": "165mm CNC Chuck",
    "price": "$950",
    "titleImage": "https://yashukaushik01.github.io/ck-enterprise-web/5_165mm_cnc_chuck.jpg",
    "heading1": "165mm CNC Chuck – Precision Engineering by C.K ENTERPRISES",
    "text1": "The 165mm CNC Chuck from C.K ENTERPRISES is crafted for optimal performance in CNC machining applications. Designed to accommodate a variety of workpiece sizes, this chuck ensures precision clamping and stability during high-speed operations.",
    "heading2": "Why Choose the 165mm CNC Chuck from C.K ENTERPRISES?",
    "text2": "Engineered with advanced gripping technology, the 165mm CNC Chuck provides a strong clamping force, reducing vibrations and enhancing accuracy. Its robust construction guarantees long-lasting durability, making it an essential tool for modern machining tasks.",
    "heading3": "Specifications:",
    "text3": "The 165mm CNC Chuck is designed to fit various CNC machines, offering versatility for different machining needs. It is suitable for both turning and milling applications.",
    "heading4": "Included Accessories:",
    "text4": "Each 165mm CNC Chuck comes with a set of soft jaws and necessary mounting hardware, ensuring easy installation and optimal performance.",
    "heading5": "Enhanced Machining Efficiency",
    "text5": "With its precision design and high-quality materials, the 165mm CNC Chuck by C.K ENTERPRISES is your go-to solution for enhancing machining efficiency and achieving high-quality results."
  },
  {
    "id": "6",
    "name": "Gripper Insert",
    "price": "$75",
    "titleImage": "https://yashukaushik01.github.io/ck-enterprise-web/6_gripper_insert.jpg",
    "heading1": "Gripper Insert – Enhanced Precision by C.K ENTERPRISES",
    "text1": "The Gripper Insert from C.K ENTERPRISES is designed to provide superior clamping force and stability for various machining applications. Engineered for high-performance, this insert ensures optimal grip and precise positioning of workpieces.",
    "heading2": "Why Choose the Gripper Insert from C.K ENTERPRISES?",
    "text2": "Crafted from high-quality materials, the Gripper Insert offers exceptional durability and reliability, reducing wear and ensuring consistent performance. Its innovative design allows for easy installation and compatibility with a variety of chuck systems.",
    "heading3": "Specifications:",
    "text3": "The Gripper Insert is available in multiple sizes and configurations, making it suitable for a wide range of CNC machining tasks. Its versatile design accommodates different workpiece shapes and sizes.",
    "heading4": "Included Accessories:",
    "text4": "Each Gripper Insert is supplied with necessary mounting hardware for straightforward installation and reliable operation.",
    "heading5": "Boost Your Machining Efficiency",
    "text5": "With its precise engineering and robust design, the Gripper Insert by C.K ENTERPRISES is your ideal choice for enhancing machining efficiency and achieving high-quality results in your projects."
  },
  {
    "id": "7",
    "name": "4 Jaw Chuck",
    "price": "$1,200",
    "titleImage": "https://yashukaushik01.github.io/ck-enterprise-web/7_four_jaws_chuck.jpg",
    "heading1": "4 Jaw Chuck – Versatile Precision Clamping by C.K ENTERPRISES",
    "text1": "The 4 Jaw Chuck from C.K ENTERPRISES is designed for versatility and precision in a variety of machining applications. Its unique design allows for independent adjustment of each jaw, making it ideal for holding irregularly shaped workpieces securely and accurately.",
    "heading2": "Why Choose the 4 Jaw Chuck from C.K ENTERPRISES?",
    "text2": "Engineered with robust construction and high-quality materials, the 4 Jaw Chuck provides exceptional stability and gripping power. Its independent jaw movement allows for precise centering and adjustment, making it a preferred choice for complex machining tasks.",
    "heading3": "Specifications:",
    "text3": "Available in various sizes starting from a diameter of 165 mm, the 4 Jaw Chuck is suitable for both small and large workpieces. Its versatility makes it perfect for turning, milling, and drilling operations.",
    "heading4": "Included Accessories:",
    "text4": "Each 4 Jaw Chuck is supplied with a set of mounting bolts and a chucknut handle, ensuring easy installation and operation.",
    "heading5": "Enhanced Machining Capabilities",
    "text5": "With its precision design and adaptability, the 4 Jaw Chuck by C.K ENTERPRISES significantly enhances your machining capabilities, allowing for more complex and precise work."
  },
  {
    "id": "8",
    "name": "Tool Post",
    "price": "$350",
    "titleImage": "https://yashukaushik01.github.io/ck-enterprise-web/8_tool_post.jpg",
    "heading1": "Tool Post – Precision Tool Holding Solution by C.K ENTERPRISES",
    "text1": "The Tool Post from C.K ENTERPRISES is designed to securely hold cutting tools in place during machining operations, ensuring precision and stability. It offers a reliable and flexible solution for various CNC and lathe machine applications.",
    "heading2": "Why Choose the Tool Post from C.K ENTERPRISES?",
    "text2": "Crafted from high-grade materials, the Tool Post ensures long-lasting performance, even under demanding machining conditions. It provides quick tool changes, minimizing downtime and boosting efficiency in the machining process.",
    "heading3": "Specifications:",
    "text3": "Available in different sizes to suit various CNC lathes and milling machines, the Tool Post offers flexibility for a wide range of cutting and machining tasks.",
    "heading4": "Included Accessories:",
    "text4": "Each Tool Post comes with essential mounting hardware, allowing for easy installation and adjustment, ensuring a firm and stable grip on cutting tools.",
    "heading5": "Improve Machining Accuracy and Efficiency",
    "text5": "With its robust construction and precise design, the Tool Post from C.K ENTERPRISES enhances machining accuracy, reduces tool wear, and improves overall efficiency in your workshop."
  }
]